## 4.9 Intro to Data Visualization with Python

### Contents

### 1. Cleaning part
### - Importing libraries and files
### - Dropping columns
### - Changing data types
### 2. Combining dataframes
### 3. Exporting dataframe

#### Before doing this assignment, I need to clean the dataframe by decreasing the sizes of some columns, dropping unnecessary columns due to the memory issues when executing the codes.

#### Importing libraries and files

In [1]:
# Import libraries
import pandas as pd
import numpy as np
import os
import matplotlib.pyplot as plt
import seaborn as sns
import scipy

In [2]:
# Create a path
path = r'C:\Users\boss4048\Documents\10-2024 Instacart Basket Analysis'

In [3]:
orders_products = pd.read_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'ord_prods_grouped_aggregated.pkl'))

In [4]:
# Drop unnecessary columns
orders_products.drop(columns = ['Unnamed: 0.1', 
                                'Unnamed: 0_x',
                                'Unnamed: 0_y',
                                'price_range_loc', 
                                'busiest_day', 
                                'busiest_period_of_day', 
                                'average_price', 
                                '_merge',
                                'median_days',
                                'max_order'
                                ], inplace = True)

In [5]:
orders_products.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32404859 entries, 0 to 32404858
Data columns (total 17 columns):
 #   Column                       Dtype
---  ------                       -----
 0   order_id                     int64
 1   user_id                      int64
 2   order_number                 int64
 3   orders_day_of_week           int64
 4   order_hour_of_day            int64
 5   total_days_since_last_order  float64
 6   product_id                   int64
 7   add_to_cart_order            int64
 8   reordered                    int64
 9   product_name                 object
 10  aisle_id                     int64
 11  department_id                int64
 12  prices                       float64
 13  Busiest days                 object
 14  loyalty_flag                 object
 15  spending_flag                object
 16  frequency_flag               object
dtypes: float64(2), int64(10), object(5)
memory usage: 4.1+ GB

In [6]:
# Change data type from int64 to int32 to reduce the dataframe size and increase system performance.
orders_products = orders_products.astype({ 'order_id'            : 'int32',
                                           'user_id'             : 'int32',
                                           'order_number'        : 'int32', 
                                           'orders_day_of_week'  : 'int32', 
                                           'order_hour_of_day'   : 'int32',
                                           'product_id'          : 'int32',
                                           'add_to_cart_order'   : 'int32', 
                                           'reordered'           : 'int32',
                                           'aisle_id'            : 'int32',
                                           'department_id'       : 'int32'
                                         })

In [7]:
orders_products.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32404859 entries, 0 to 32404858
Data columns (total 17 columns):
 #   Column                       Dtype
---  ------                       -----
 0   order_id                     int32
 1   user_id                      int32
 2   order_number                 int32
 3   orders_day_of_week           int32
 4   order_hour_of_day            int32
 5   total_days_since_last_order  float64
 6   product_id                   int32
 7   add_to_cart_order            int32
 8   reordered                    int32
 9   product_name                 object
 10  aisle_id                     int32
 11  department_id                int32
 12  prices                       float64
 13  Busiest days                 object
 14  loyalty_flag                 object
 15  spending_flag                object
 16  frequency_flag               object
dtypes: float64(2), int32(10), object(5)
memory usage: 2.9+ GB

In [8]:
orders_products.to_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'ord_prods_cleaned.pkl'))

#### 3. Import your analysis libraries, as well as your new customer data set as a dataframe.

In [9]:
# Import the new dataset as a dataframe
new_customer = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'customers.csv'))

#### 4. Wrangle the data so that it follows consistent logic; for example, rename columns with illogical names and drop columns that donâ€™t add anything to your analysis.

In [10]:
# Run the code to see the dataframe
new_customer.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

4.1 Rename the columns

In [11]:
new_customer.rename(columns = 
                    {'Surnam'       : 'Last Name',
                     'STATE'        : 'State',
                     'date_joined'  : 'Date Joined',
                     'n_dependants' : 'Number of Dependents',
                     'fam_status'   : 'Family Status',
                     'income'       : 'Income'}
                     , inplace = True)

In [12]:
# Run the code to see the column names after renaming
# I decided to leave the 'user_id' column name as it is for future merging purposes. It has to be the same name.
new_customer.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 206209 entries, 0 to 206208
Data columns (total 10 columns):
 #   Column                Non-Null Count   Dtype
---  ------                --------------   -----
 0   user_id               206209 non-null  int64
 1   First Name            194950 non-null  object
 2   Last Name             206209 non-null  object
 3   Gender                206209 non-null  object
 4   State                 206209 non-null  object
 5   Age                   206209 non-null  int64
 6   Date Joined           206209 non-null  object
 7   Number of Dependents  206209 non-null  int64
 8   Family Status         206209 non-null  object
 9   Income                206209 non-null  int64
dtypes: int64(4), object(6)
memory usage: 15.7+ MB

4.2 Changing a variableâ€™s data type

In [13]:
# The user_id column has a data type of int64; I am changing it to a string data type.
new_customer['user_id'] = new_customer['user_id'].astype('str')

In [14]:
# Test the result after changing the data type.
new_customer['user_id'].dtype

dtype('O')

Since we have changed the data type of another dataframe (please check 4.9 (Part 0) Cleaning large dataframe notebook),I need to change the data type from int64 to int32 of this datframe as well to make them match when merging.

In [15]:
new_customer.astype({ 'Age' : 'int32',
                      'Number of Dependents' : 'int32',
                      'Income' : 'int32'    
                    })

,user_id,First Name,Last Name,Gender,State,Age,Date Joined,Number of Dependents,Family Status,Income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374
...,...,...,...,...,...,...,...,...,...,...
206204,168073,Lisa,Case,Female,North Carolina,44,4/1/2020,1,married,148828
206205,49635,Jeremy,Robbins,Male,Hawaii,62,4/1/2020,3,married,168639
206206,135902,Doris,Richmond,Female,Missouri,66,4/1/2020,2,married,53374
206207,81095,Rose,Rollins,Female,California,27,4/1/2020,1,married,99799
206208,80148,Cynthia,Noble,Female,New York,55,4/1/2020,1,married,57095

#### 5. Complete the fundamental data quality and consistency checks youâ€™ve learned throughout this Achievement; for example, check for and address missing values and duplicates, and convert any mixed-type data.

5.1 Missing values

In [16]:
# Use isnull.() to find how many rows in each column are empty.
new_customer.isnull().sum()

user_id                     0
First Name              11259
Last Name                   0
Gender                      0
State                       0
Age                         0
Date Joined                 0
Number of Dependents        0
Family Status               0
Income                      0
dtype: int64

We can see that the 'First Name' column has NaNs. I will not replace them because first names can be unique and cannot be substituted with any other values. I also will not drop the rows with missing values; I have decided to leave them as they are.

5.2 Convert any mixed-type data

In [17]:
# Use for-loop to find out if there is any mixed data.
for col in new_customer.columns.tolist():
  weird = (new_customer[[col]].map(type) != new_customer[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (new_customer[weird]) > 0:
    print (col)

First Name

After researching, I found that if I convert the entire column to one data type (string), all values, including those with NaN values, would be converted to strings. As a result, we would no longer be able to detect the NaN values after the conversion. Therefore, I am leaving it as it is in case we might do something from rows with NaN values in the future.

5.3 Duplicates

In [18]:
new_customer[new_customer.duplicated()]

Empty DataFrame
Columns: [user_id, First Name, Last Name, Gender, State, Age, Date Joined, Number of Dependents, Family Status, Income]
Index: []

The result shows that there are no duplicates in this dataframe.

#### 6. Combine your customer data with the rest of your prepared Instacart data. (Hint: Make sure the key columns are the same data type!)

Importing the dataframe from the prepared Instacart data.

In [19]:
orders_products = pd.read_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'ord_prods_cleaned.pkl'))

In [20]:
orders_products.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,total_days_since_last_order,product_id,add_to_cart_order,reordered,product_name,aisle_id,department_id,prices,Busiest days,loyalty_flag,spending_flag,frequency_flag
0,2539329,1,1,2,8,NaN,196,1,0,Soda,77,7,9.0,Regularly busy,New customer,Low spender,Non-frequent customer
1,2539329,1,1,2,8,NaN,14084,2,0,Organic Unsweetened Vanilla Almond Milk,91,16,12.5,Regularly busy,New customer,Low spender,Non-frequent customer
2,2539329,1,1,2,8,NaN,12427,3,0,Original Beef Jerky,23,19,4.4,Regularly busy,New customer,Low spender,Non-frequent customer
3,2539329,1,1,2,8,NaN,26088,4,0,Aged White Cheddar Popcorn,23,19,4.7,Regularly busy,New customer,Low spender,Non-frequent customer
4,2539329,1,1,2,8,NaN,26405,5,0,XL Pick-A-Size Paper Towel Rolls,54,17,1.0,Regularly busy,New customer,Low spender,Non-frequent customer

Combining 2 dataframes

In [21]:
# Recheck if the key columns (user_id) on both dataframes are the same data type.
orders_products['user_id'].dtype

dtype('int32')

The data type of the key column in the orders_products dataframe is int64, whereas the key column in the new_customer dataframe is a string. We need to change it to be the same.

In [22]:
# Change the user_id column datatype of orders_products dataframe.
orders_products['user_id'] = orders_products['user_id'].astype('str')

In [23]:
# Merge 2 dataframes with user_id as the key column.
df_merged = orders_products.merge(new_customer, on = 'user_id', indicator = True)

In [24]:
# Check if both dataframes have a full match after inner join
df_merged['_merge'].value_counts()

_merge
both          32404859
left_only            0
right_only           0
Name: count, dtype: int64

The merge flags show us there is a full match between the two input dataframes from the code with inner join.

In [25]:
# Compare the counts if 2 dataframes have a full match as well without overwriting it from outer join.
(pd.merge(orders_products,new_customer, on = 'user_id', how = 'outer', indicator = True))['_merge'].value_counts()

_merge
both          32404859
left_only            0
right_only           0
Name: count, dtype: int64

The result shows that both have a full match.

#### 8. Export this new dataframe as a pickle file so you can continue to use it in the second part of this task.

In [26]:
df_merged.to_pickle(os.path.join(path, '02 Data', 'Prepared Data', '4.9 Cleaned dataframe.pkl'))